Tekla Open API Reference for Tekla Structures 2025
ArrowheadTypes Enumeration
 The arrowhead types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ArrowheadTypes
Public Enumeration ArrowheadTypes
Members
Member name | Value | Description
NoArrow | -1005 |  No arrowhead.
FilledArrow | -1004 |  The filled arrowhead.
LineArrow | -1003 |  The line arrowhead.
CircleArrow | -1002 |  The open circle arrowhead.
FilledCircleArrow | -1001 |  The filled circle arrowhead.
See Also
Reference
Tekla.Structures.Drawing Namespace